import 'package:get/get.dart';

class MyTranslation extends Translations {
  @override
  Map<String, Map<String, String>> get keys => {
        'ar': {
          'under_dev': 'الخاصية مازالت تحت التطوير',
          'login': 'تسجيل الدخول',
          'watch': 'انتبه!',
          'logout': 'تسجيل خروج',
          'username': 'اسم المستخدم',
          'pass': 'كلمة المرور',
          'old_pass': 'كلمة المرور القديمة',
          'confirm_pass': 'تأكيد كلمة المرور',
          'forget': 'هل نسيت كلمة المرور؟',
          'forget_title': 'هل نسيت كلمة المرور؟',
          'retreive_pass': 'استرجاع كلمة المرور',
          'change_pass': 'تغيير كلمة المرور',
          'pass_war': 'ادخل كلمة المرور',
          'confirm_pass_war': 'كلمة المرور ليست مطابقة!',
          'send_ver': 'ارسل رمز التحقق الى بريدك',
          'enter_ver': 'ادخل رمز التحقق',
          'check': 'تأكيد',
          'ver_war': 'ادخل كود تأكيد صحيح',
          'ver_code': 'رمز التحقق',
          'username_war': 'ادخل اسم المستخدم',
          'remember': 'تذكرني',
          'no_connection':
              'تأكد من الاتصال بالانترنت بالباقه او النت الهوائي😢',
          'http_ex': 'خطأ في الطلب',
          'bad_response': 'مشكلة في الرد من السيرفر',
          'user_groups': 'مجموعات المستخدمين',
          'admin_group': 'مجموعة مدير النظام',
          'show_user_groups': 'اظهار جميع المجموعات المسجلة',
          'add_group': 'اضافة مجموعة',
          'group_name': 'اسم المجموعة',
          'group_des': 'وصف المجموعة',
          'active_groups': 'مجموعة نشطة',
          'users_title': 'المستخدمين',
          'show_users': 'اظهار جميع المستخدمين',
          'data': 'السكرتير فهد',
          'cancel': 'الغاء',
          'add': 'اضافة',
        }
      };
}
